{
    "projects": [
        {
                "title": "Job Scraper",
                "description":{
                    "EN": [
                        "Job Scraper and Automator that scans job listing pages like LinkedIn, Tanit Jobs, and Emploi Tunisie, overcoming Cloudflare CAPTCHAs to gather potential job opportunities in Tunisia.",
                        "Job Scoring that uses DeepSeek API to assess and score job listings based on relevance and quality.",
                        "Instant Notifications that send real-time job alerts via Telegram, ensuring you never miss a relevant opportunity."
    
                    ],
                    "FR": [
                        "Scraper et Automator d'offres d'emploi qui scanne les pages de listing d'offres d'emploi comme LinkedIn, Tanit Jobs et Emploi Tunisie, surmontant les CAPTCHAs Cloudflare pour rassembler des opportunités d'emploi potentielles en Tunisie.",
                        "Job Scoring qui utilise l'API DeepSeek pour évaluer et noter les offres d'emploi en fonction de leur pertinence et de leur qualité.",
                        "Notifications instantanées qui envoient des alertes d'emploi en temps réel via Telegram, vous assurant de ne jamais manquer une opportunité pertinente."
                    ]
            },
            "projectLink": "",
            "githubLink": "" ,
            "projectImgLink": "job.png",
            "stack": [
                {
                    "name": "Python",
                    "imgPath": "python.png"
                },
                {
                    "name": "Selenium",
                    "imgPath": "selenium.png"
                },
                {
                    "name": "DeepSeek",
                    "imgPath": "deepseek.png"
                },
                {
                    "name": "Telegram",
                    "imgPath": "telegram.webp"
                }
            ]
        },
        {
                "title": "Snake Game",
                "description":{
                    "EN": [
                        "Project built with React and a borderless board where the snake wraps around from side to side.",
                        "the speed increases dynamically with length, adding challenge as the game progresses",
                        "Endless gameplay with no borders, creating a continuous and challenging experience."
    
                    ],
                    "FR": [
                        "Jeu de Snake créé avec React, avec un plateau sans bordures où le serpent se déplace d'un côté à l'autre.",
                        "La vitesse du serpent augmente dynamiquement en fonction de sa longueur, rendant le jeu de plus en plus difficile.",
                        "Jeu sans fin avec une difficulté croissante et aucun bord pour limiter le mouvement."
                    ]

            },
            "projectLink": "https://saidaniamine12.github.io/snake-game/",
            "githubLink": "https://github.com/saidaniamine12/snake-game" ,
            "projectImgLink": "snake-game.png",
            "stack": [
                {
                    "name": "React",
                    "imgPath": "react.png"
                },
                {
                    "name": "TypeScript",
                    "imgPath": "typescript.png"
                },
                {
                    "name": "HTML",
                    "imgPath": "html.png"
                },
                {
                    "name": "CSS",
                    "imgPath": "css-3.png"
                }
            ]
        },
        {
            "title": "Portfolio",
            "description":{
                "EN": [
                    "Built a dynamic and responsive personal portfolio, showcasing my skills and projects with a modern design.",
                    "Developed reusable and modular components to ensure maintainability and scalability, providing a smooth user experience across devices.."

                ],
                "FR": [
                    "Création d'un portfolio personnel dynamique et réactif avec React, TypeScript et Tailwind CSS, mettant en valeur mes compétences et projets avec un design moderne.",
                    "Développement de composants réutilisables et modulaires pour garantir la maintenabilité et la scalabilité, offrant une expérience utilisateur fluide sur tous les appareils."                    
                ]
        },
        "projectLink": "https://saidaniamine12.github.io/portfolio",
        "githubLink": "https://github.com/saidaniamine12/portfolio" ,
        "projectImgLink": "cv.png",
        "stack": [
            {
                "name": "TypeScript",
                "imgPath": "typescript.png"
            },
            {
                "name": "React",
                "imgPath": "react.png"
            },
            {
                "name": "Tailwind CSS",
                "imgPath": "tailwindcss.png"
            },
            {
                "name": "HTML",
                "imgPath": "html.png"
            },
            {
                "name": "CSS",
                "imgPath": "css-3.png"
            }
        ]
    },
        {
            "title": "IOT Data Collector",
            "description":{
                "EN": [
                    "Sensor data is collected using a Raspberry Pi and sent to a Kafka broker deployed on Azure, which acts as a middleware for reliable data streaming.",
                    "The data was then passed from Kafka to MongoDB, where it was stored and could easily handle any large spikes in data.",
                    "Used Grafana to visualize the data from MongoDB, creating real-time charts and dashboards to track everything as it happened."

                ],
                "FR": [
                    "Les données des capteurs sont collectées à l'aide d'un Raspberry Pi et envoyées à un courtier Kafka, qui agit comme un intermédiaire pour le streaming de données fiable.",
                    "Les données ont ensuite été transmises de Kafka à MongoDB, où elles ont été stockées et pouvaient facilement gérer tout pic important de données.",
                    "j'ai Utilisé Grafana pour visualiser les données de MongoDB, créant des graphiques et des tableaux de bord en temps réel pour suivre tout ce qui se passait."
                ]

        },
        "projectLink": "",
        "githubLink": "" ,
        "projectImgLink": "iot.png",
        "stack": [
            {
                "name": "Raspberry Pi",
                "imgPath": "raspberry-pi.png"
            },
            {
                "name": "Kafka",
                "imgPath": "kafka.png"
            },
            {
                "name": "MongoDB",
                "imgPath": "mongodb.png"
            },
            {
                "name": "Grafana",
                "imgPath": "grafana.jpg"
            },
            {
                "name": "Azure",
                "imgPath": "azure.png"
            }
        ]
        },
        {
            "title": "French Tacos App",
            "description":{
                "EN": [
                    "Developed a robust back-end with Spring Boot and MySQL to handle user requests, process orders, and ensure reliable data storage and performance.",
                    "Designed and implemented a dynamic, responsive front-end using Angular to provide an intuitive and seamless taco ordering experience.",
                    "Implemented real-time order management and reliable data storage for a smooth user experience."

                ],
                "FR": [
                    "Réalisation d'un back-end robuste avec Spring Boot et MySQL pour gérer les demandes des utilisateurs, traiter les commandes et assurer une gestion fiable des données et des performances.",
                    "Conception et mise en œuvre d'une interface front-end dynamique et réactive avec Angular pour offrir une expérience de commande de tacos intuitive et fluide.",
                    "Mise en place d'une gestion des commandes en temps réel et d'un stockage des données fiable pour garantir une expérience utilisateur optimale."
                ]

        },
        "projectLink": "",
        "githubLink": "https://github.com/saidaniamine12/TacoApp" ,
        "projectImgLink": "tacos.png",
        "stack": [
            {
                "name": "Java",
                "imgPath": "java.png"
            },
            {
                "name": "SpringBoot",
                "imgPath": "spring-boot.png"
            },
            {
                "name": "Angular",
                "imgPath": "angular.png"
            },
            {
                "name": "MySQL",
                "imgPath": "mysql.png"
            }
        ]
        },
        {
            "title": "Book Exchange Platform",
            "description":{
                "EN": [
                    "Built a book exchange platform where users can post books for others to borrow, developed using the MEAN stack.",
                    "Developed a real-time messaging system using Socket.io to facilitate seamless communication between users.",
                    "Created an interactive and functional user interface with Angular, paired with a robust database management system using MongoDB.."

                ],
                "FR": [
                    "Création d'une plateforme d'échange de livres où les utilisateurs peuvent poster leurs livres à prêter, développée avec le stack MEAN.",
                    "Développement d'un système de messagerie en temps réel utilisant Socket.io pour permettre une communication fluide entre les utilisateurs.",
                    "Mise en place d'une interface utilisateur interactive et fonctionnelle avec Angular, couplée à une gestion de base de données robuste avec MongoDB."
                ]

        },
        "projectLink": "",
        "githubLink": "https://github.com/saidaniamine12/book-Exchange" ,
        "projectImgLink": "stack-of-books.png",
        "stack": [
            {
                "name": "TypeScript",
                "imgPath": "typescript.png"
            },
            {
                "name": "MongoDB",
                "imgPath": "mongodb.png"
            },
            {
                "name": "Express",
                "imgPath": "express.webp"
            },
            {
                "name": "Angular",
                "imgPath": "angular.png"
            },
            {
                "name": "Node.js",
                "imgPath": "node.png"
            }
        ]
        }
    ]
}